# ==========================================
# โจทย์ข้อที่ 4: คำนวณค่าไฟฟ้า
# Input: จำนวนหน่วยไฟฟ้าที่ใช้ (จำนวนเต็มบวก)
# เงื่อนไขคิดราคา:
#   - 50 หน่วยแรก คิดหน่วยละ 3 บาท
#   - ส่วนที่เกิน 50 หน่วยขึ้นไป คิดหน่วยละ 5 บาท
# Output: ค่าไฟฟ้าทั้งหมด (จำนวนเต็ม)
# ตัวอย่าง: 
#   - ใช้ 30 หน่วย -> 30 * 3 = 90 บาท
#   - ใช้ 70 หน่วย -> (50 * 3) + (20 * 5) = 250 บาท
# ==========================================

# นักเรีPRINTยนเขียนโค้ดต่อจากบรรทัดนี้
Input: จำนวนหน่วยไฟฟ้าที่ใช้ (120)
เงื่อนไขคิดราคา:
  Print1=("50หน่วยแรก คิดหน่วยล่ะ 3บาท")
  Print2=("50>= คิดหน่วยล่ะ 5 บาท")
OUT PUT=("ค่าไฟทั้งหมด")
